aboutJava/ideaWorkWithMaven.org
#+TITLE: IDEA和Maven协同工作

IDEA基本取代了eclipse，尤其是maven和eclipse配合那么烂的前提下，更加喜欢IDEA。

以下介绍IDEA下如何通过jUnit进行单元测试。
#+BEGIN_SRC

1. IDEA安装插件，JUnit和JUnitGenerator V2.0，重启IDEA
2. IDEA设置，进入Preferences中，Other Settings里找到JUnit generator
将Output Path改为：${SOURCEPATH}/../../test/java/${PACKAGE}/${FILENAME}
Default Template：JUnit4
再重启IDEA
3. IDEA设置，进入Project Structure，进入Modules进行如下设置

src/main/java设置为Sources
src/main/resources设置为Resources
src/test/java设置为Tests（Package prefix:test,否则一直提示包名错误）
src/test/resources设置为Test Resources

#+END_SRC
