aboutJava/ideaWorkWithMaven.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>IDEA和Maven协同工作</title>
<!-- 2016-12-16 Fri 11:42 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="赵光建" />
</head>
<body>
<div id="content">
<h1 class="title">IDEA和Maven协同工作</h1>
<p>
IDEA基本取代了eclipse，尤其是maven和eclipse配合那么烂的前提下，更加喜欢IDEA。
</p>

<p>
以下介绍IDEA下如何通过jUnit进行单元测试。
</p>
<pre class="example">
1. IDEA安装插件，JUnit和JUnitGenerator V2.0，重启IDEA
2. IDEA设置，进入Preferences中，Other Settings里找到JUnit generator
将Output Path改为：${SOURCEPATH}/../../test/java/${PACKAGE}/${FILENAME}
Default Template：JUnit4
再重启IDEA
3. IDEA设置，进入Project Structure，进入Modules进行如下设置

src/main/java设置为Sources
src/main/resources设置为Resources
src/test/java设置为Tests（Package prefix:test,否则一直提示包名错误）
src/test/resources设置为Test Resources
</pre>
</div>
<div id="postamble" class="status">
<p class="author">Author: 赵光建</p>
<p class="date">Created: 2016-12-16 Fri 11:42</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
